Creating RGRE 

Result:
```
jkalanda@Josephs-MacBook-Pro transitgateway % terraform plan 
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 4s [id=b9507191-b6f5-4476-b820-16eddc34638d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_tg_connection.test_ibm_tg_connection will be created
  + resource "ibm_tg_connection" "test_ibm_tg_connection" {
      + base_connection_id    = (known after apply)
      + base_network_type     = "classic"
      + connection_id         = (known after apply)
      + created_at            = (known after apply)
      + default_prefix_filter = (known after apply)
      + gateway               = "b9507191-b6f5-4476-b820-16eddc34638d"
      + id                    = (known after apply)
      + name                  = "rgre-terraform-jk"
      + network_account_id    = (known after apply)
      + network_id            = (known after apply)
      + network_type          = "redundant_gre"
      + related_crn           = (known after apply)
      + request_status        = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)

      + tunnels {
          + created_at        = (known after apply)
          + local_bgp_asn     = (known after apply)
          + local_gateway_ip  = "192.193.200.1"
          + local_tunnel_ip   = "192.193.239.2"
          + mtu               = (known after apply)
          + name              = "tunne1_terraform"
          + remote_bgp_asn    = (known after apply)
          + remote_gateway_ip = "10.144.104.123"
          + remote_tunnel_ip  = "192.193.239.1"
          + status            = (known after apply)
          + tunnel_id         = (known after apply)
          + updated_at        = (known after apply)
          + zone              = "us-south-1"
        }
      + tunnels {
          + created_at        = (known after apply)
          + local_bgp_asn     = (known after apply)
          + local_gateway_ip  = "192.193.201.1"
          + local_tunnel_ip   = "192.193.238.2"
          + mtu               = (known after apply)
          + name              = "tunne2_terraform"
          + remote_bgp_asn    = (known after apply)
          + remote_gateway_ip = "10.144.104.123"
          + remote_tunnel_ip  = "192.193.238.1"
          + status            = (known after apply)
          + tunnel_id         = (known after apply)
          + updated_at        = (known after apply)
          + zone              = "us-south-1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
jkalanda@Josephs-MacBook-Pro transitgateway % terraform apply
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 5s [id=b9507191-b6f5-4476-b820-16eddc34638d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_tg_connection.test_ibm_tg_connection will be created
  + resource "ibm_tg_connection" "test_ibm_tg_connection" {
      + base_connection_id    = (known after apply)
      + base_network_type     = "classic"
      + connection_id         = (known after apply)
      + created_at            = (known after apply)
      + default_prefix_filter = (known after apply)
      + gateway               = "b9507191-b6f5-4476-b820-16eddc34638d"
      + id                    = (known after apply)
      + name                  = "rgre-terraform-jk"
      + network_account_id    = (known after apply)
      + network_id            = (known after apply)
      + network_type          = "redundant_gre"
      + related_crn           = (known after apply)
      + request_status        = (known after apply)
      + status                = (known after apply)
      + updated_at            = (known after apply)

      + tunnels {
          + created_at        = (known after apply)
          + local_bgp_asn     = (known after apply)
          + local_gateway_ip  = "192.193.200.1"
          + local_tunnel_ip   = "192.193.239.2"
          + mtu               = (known after apply)
          + name              = "tunne1_terraform"
          + remote_bgp_asn    = (known after apply)
          + remote_gateway_ip = "10.144.104.123"
          + remote_tunnel_ip  = "192.193.239.1"
          + status            = (known after apply)
          + tunnel_id         = (known after apply)
          + updated_at        = (known after apply)
          + zone              = "us-south-1"
        }
      + tunnels {
          + created_at        = (known after apply)
          + local_bgp_asn     = (known after apply)
          + local_gateway_ip  = "192.193.201.1"
          + local_tunnel_ip   = "192.193.238.2"
          + mtu               = (known after apply)
          + name              = "tunne2_terraform"
          + remote_bgp_asn    = (known after apply)
          + remote_gateway_ip = "10.144.104.123"
          + remote_tunnel_ip  = "192.193.238.1"
          + status            = (known after apply)
          + tunnel_id         = (known after apply)
          + updated_at        = (known after apply)
          + zone              = "us-south-1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_tg_connection.test_ibm_tg_connection: Creating...
ibm_tg_connection.test_ibm_tg_connection: Still creating... [10s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Still creating... [20s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Still creating... [30s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Still creating... [40s elapsed]
ibm_tg_connection.test_ibm_tg_connection: Creation complete after 48s [id=b9507191-b6f5-4476-b820-16eddc34638d/3678c082-ef94-492d-9074-0f438dc6a074]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
jkalanda@Josephs-MacBook-Pro transitgateway % terraform plan 
data.ibm_tg_gateway.existing_tg_gw: Reading...
data.ibm_tg_gateway.existing_tg_gw: Read complete after 4s [id=b9507191-b6f5-4476-b820-16eddc34638d]
ibm_tg_connection.test_ibm_tg_connection: Refreshing state... [id=b9507191-b6f5-4476-b820-16eddc34638d/3678c082-ef94-492d-9074-0f438dc6a074]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```